import random

items = [
    "ラムネ", 
    "ハンバーガー",
    "紅茶",
    "サンドウィッチ",
    "ケーキ",
    "辛いもの",
    "コーヒー",
    "ガムシロップ",
    "はちみつ",
    "中華料理",
    "肉料理",
    "工夫茶",
    "和食",
    "魚料理",
    "ベトナム料理",
    "駄菓子",
    "牛丼",
    "スコーン",
    "お米",
    "マンゴー",
    "ラッシー",
    "味のり",
    "ビーフシチュー",
    "ザクロ",
    "ヨーグルト",
    "カップ麺",
    "カップ焼きそば",
    "刺身",
    "寿司",
    "和菓子",
    "きのこ",
    "クリームシチュー",
    "健康補助食品",
    "完全食",
    "たい焼き",
    "ラーメン",
    "シュークリーム",
    "オムライス",
    "ウニ",
    "飴",
    "ガム",
    "コロッケ",
    "果物",
    "タルト",
    "焼き菓子",
    "麻婆豆腐",
    "マカロン",
    "ショートケーキ",
    "おにぎり",
    "抹茶",
    "エビフライ",
    "プリン",
    "コーラ",
    "カレー(辛口)",
    "サラダ",
    "レアチーズケーキ",
    "棒付き飴",
    "お好み焼き",
    "焼きそば",
    "ステーキ",
    "アイス",
    "なめろう",
    "カルピス",
    "蕎麦",
    "うどん",
    "豆腐",
    "カレー(甘口)",
    "チーズ",
    "わたあめ",
    "ソフトクリーム",
    "フルーツパフェ",
    "トウモロコシ",
    "すっぱいグミ",
    "クレープ",
    "チョコバナナ",
    "ドーナツ",
    "グラタン",
    "激辛ラーメン",
    "レバー",
    "ゴーヤ",
    "ナマコ",
    "ニンジン",
    "かき氷",
    "梅干し",
    "ピータン",
    "パクチー",
    "干しブドウ",
    "納豆",
    "タコ",
    "ピーマン",
    "ブラックコーヒー",
    "ブルーチーズ",
    "豚足",
    "高野豆腐",
    "イカスミパスタ",
    "とろろ"
]

christmas = [
    "フライドチキン",
    "ローストチキン",
    "ローストビーフ",
    "ブッシュドノエル",
    "シュトーレン",
    "クリスマスケーキ"
]

newyear = [
  "かまぼこ",
  "雑煮",
  "黒豆",
  "伊達巻",
  "数の子",
  "栗きんとん",
  "昆布巻",
  "エビ"
]

def get_fortune(name, today):
    f = randomFortune()
    item = randomItem(today)
    msg = f"{name}さんの運勢は{f}だってさ\nラッキーフードは{item}だよ"
    return msg

def randomFortune():
  fortunes = ["大吉", "吉", "中吉", "小吉", "末吉", "凶", "大凶"]
  probabilities = [0.1, 0.2, 0.2, 0.2, 0.2, 0.2, 0.1]
  result = random.choices(fortunes, probabilities, k=1)[0]
  return result

def randomItem(today):
  if today.month == 1 and 1 <= today.day <= 3:
    result = random.choices(newyear)[0]
  elif today.month == 12 and 24 <= today.day <= 25:
    result = random.choices(christmas)[0]
  else:
    result = random.choices(items)[0]

  print(f"today is {today.month}/{today.day}")

  return result
